# Собираем контейнер на основе образа node.js
FROM node:latest

# Создаем рабочую папку
RUN mkdir /app
WORKDIR /app

# Ускоряем запуск контейнера, с помощью кэша. Собрав слой один раз, в дальнейшем если не будет изменений в этих файлах то будет использоваться кэш
COPY package.json /app
COPY yarn.lock /app
RUN yarn install

# Скопируем весь проект в рабочую папку
COPY . /app

# Тестируем приложение
RUN yarn test
# Собираем приложение
RUN yarn build
# Запускаем приложение при включении докер контейнера
CMD yarn start

# Сообщаем людям что приложение использует порт 3000 :)
EXPOSE 3000
